### Problem Statement: Extract data from the given SalaryGender CSV file and store the data from each column in a separate NumPy array.

In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('C:/data/SalaryGender.csv',delimiter = ',')
Salary = np.array(df['Salary'])
Gender = np.array(df['Gender'])
Age = np.array(df['Age'])

In [2]:
print(df)

    Salary  Gender  Age  PhD
0    140.0       1   47    1
1     30.0       0   65    1
2     35.1       0   56    0
3     30.0       1   23    0
4     80.0       0   53    1
..     ...     ...  ...  ...
95    18.6       1   26    0
96   152.0       1   56    1
97     1.8       1   28    0
98    35.0       0   44    0
99     4.0       0   24    0

[100 rows x 4 columns]

In [3]:
df.head()

   Salary  Gender  Age  PhD
0   140.0       1   47    1
1    30.0       0   65    1
2    35.1       0   56    0
3    30.0       1   23    0
4    80.0       0   53    1

In [4]:
df.tail()

    Salary  Gender  Age  PhD
95    18.6       1   26    0
96   152.0       1   56    1
97     1.8       1   28    0
98    35.0       0   44    0
99     4.0       0   24    0

In [5]:
df.describe()

           Salary      Gender         Age         PhD
count  100.000000  100.000000  100.000000  100.000000
mean    52.524500    0.500000   46.880000    0.390000
std     42.220933    0.502519   15.271469    0.490207
min      0.250000    0.000000   20.000000    0.000000
25%     20.000000    0.000000   31.500000    0.000000
50%     39.300000    0.500000   49.000000    0.000000
75%     75.500000    1.000000   60.000000    1.000000
max    190.000000    1.000000   77.000000    1.000000

In [6]:
df.isna().sum()

Salary    0
Gender    0
Age       0
PhD       0
dtype: int64

In [7]:
###no missing value in the dataset